app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
---
    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();
        //$artikel = $model->findAll();
        $data = [
            'title' => $title,
            'q'     => $q,
            'artikel' => $model->like('judul', $q)->paginate(3), #data dibatasi 3 record per halaman